drop database if exists Db_1C7;
CREATE DATABASE Db_1C7 CHARACTER SET utf8 COLLATE utf8_general_ci;

use Db_1C7;

drop table if exists contragents;
create table contragents (
     id                              bigint not null unique,
     name                            text,
     naimnovanie_polnoe              text,
     inn                             text,
     kpp                             text,
     ur_fiz_litso                    text,
     pochtavoi_address               text ,
     telephone                       text,


     osnovnoi_dogovor_contragent      text,
     osnovnoi_bank_shot             text,

     commentary                     text,

     primary key (id)
);


insert into contragents (id, name, naimnovanie_polnoe, inn, kpp, ur_fiz_litso, pochtavoi_address, telephone) values


(1,	'01-Сервис ООО',	'01-Сервис ООО',	'3661025271',	'366101001',	'394033, г.Воронеж, ул.Витрука, д.13',	'394033, г.Воронеж, ул.Витрука, д.13',	'(23-56-76) (51-82-51), (8-960 - 116-33-44)'),
(2,	'100 Киловатт.ру ООО',	'100 Киловатт.ру ООО',	'7328098102',	'732801001',	'432059, г.Ульяновск,Киевский бульвар 24,офис 13',	'432072, г.Ульяновск, а/я 3588',	'8 800-350-81-86'),
(3,	'Booking.com B.V.',	'Booking.com B.V.',	'7702216772',	'997950001',	'1000 BP Amsterdam Нидерланды, а/я 1639',	'1000 BP Amsterdam Нидерланды, а/я 1639',	'((495) 642-71-42) (+31 (0) 20 71 33 555)'),
(4,	'Expedia Lodging Partner',	'Expedia Lodging Partner Services Sarl',	'9909386661',	'775087001',	'333 108th Ave. NE, Bellevue, WA 98004',	'333 108th Ave. NE, Bellevue, WA 98004',	'425-679-7251  +44-20-7019-2008'),
(5,	'Vodagorki.Inc',	'Vodagorki.Inc	.','',''	, 	'4169 Sturgeon Court.San Diego.California 92130 USA',	'4169 Sturgeon Court.San Diego.California 92130 USA',	'+1.858.361.3202'),
(6,	'А ГРУПП ООО',	'ООО "А ГРУПП"',	'6315658228',	'631901001',	'443022, Самарская обл., г. Самара,Заводское ш.,дом №20, офис 201',	'443022, Самарская обл., г. Самара,Заводское ш.,дом №20, офис 201',	''),
(7,	'АБ РОССИЯ АО Воронежский ф-л',	'АО "АБ "РОССИЯ" Воронежский филиал',	'7831000122',	'366443001',	'191124, РФ г. Санкт-Петербург, пл. Растрелли, д. 2 лит. А',	'394006, г. Воронеж, пер. Красноармейский, д. 12а',	'(4722)35-65-25, ф. 32-70-84'),
(8,	'АБ РОССИЯ АО Воронежский ф-л',	'АО "АБ "РОССИЯ"',	'7831000122',	'366443001',	'191124, г.Санкт-Петербург, пл. Растрелли, д.2, лит.А',	'394006,г. Воронеж, пер. Красноармейский,д.12а.',	'44-06-62, ф.44-07-70'),
(9,	'АБ РОССИЯ АО Тульский филиал',	'АБ РОССИЯ АО Тульский филиал',	'7831000122',	'710743001',	'191124 , Санк- Петербург, пл. Растрелли, д.2 лит А',	'300007, г.Тула, ул. Благовещенская, д.6',	'377-500 (127) Юлия, (143) Наталья'),
(10,	'АБ РОССИЯ АО Тульский ф-л Смол',	'АО "АБ "РОССИЯ" Тульский филиал "Смоленский" Операционный офис',	'7831000122',	'710743002',	'191124, РФ г. Санкт-Петербург, пл. Растрелли, д. 2 лит. А',	'214018, г.Смоленск, ул. Ново - Рославльская, д.3а',	'(4812) 35-17-71');

